zephyrproject-rtos/hal_stm32/stm32cube/stm32mp13xx/drivers/include/stm32mp13xx_ll_etzpc.h
/**
  * @brief  Set PKA peripheral (ETZPC Securable peripheral) protection.
  *
  * @param  ETZPCx ETZPC Instance
  * @param  protection  : protection level of the peripheral : possible values are
  *                      - LL_ETZPC_PERIPH_PROTECTION_READ_WRITE_SECURE
  *                      - LL_ETZPC_PERIPH_PROTECTION_READ_NONSECURE_WRITE_SECURE
  *                      - LL_ETZPC_PERIPH_PROTECTION_READ_WRITE_NONSECURE
  * @retval None
  */
__STATIC_INLINE void LL_ETZPC_Set_PKA_PeriphProtection(ETZPC_TypeDef *ETZPCx, uint32_t protection)
{
  ETZPC_MODIFY_REG(DECPROT2, PKA, protection);
}

/**
  * @brief  Set Backup RAM (BKPSRAM) peripheral (ETZPC Securable peripheral) protection.
  *
  * @param  ETZPCx ETZPC Instance
  * @param  protection  : protection level of the peripheral : possible values are
  *                      - LL_ETZPC_PERIPH_PROTECTION_READ_WRITE_SECURE
  *                      - LL_ETZPC_PERIPH_PROTECTION_READ_NONSECURE_WRITE_SECURE
  *                      - LL_ETZPC_PERIPH_PROTECTION_READ_WRITE_NONSECURE
  * @retval None
  */
__STATIC_INLINE void LL_ETZPC_Set_BKPSRAM_PeriphProtection(ETZPC_TypeDef *ETZPCx, uint32_t protection)
{
  ETZPC_MODIFY_REG(DECPROT2, BKPSRAM, protection);
}

/**
  * @brief  Set ETH1 peripheral (ETZPC Securable peripheral) protection.
  *
  * @param  ETZPCx ETZPC Instance
  * @param  protection  : protection level of the peripheral : possible values are
  *                      - LL_ETZPC_PERIPH_PROTECTION_READ_WRITE_SECURE
  *                      - LL_ETZPC_PERIPH_PROTECTION_READ_NONSECURE_WRITE_SECURE
  *                      - LL_ETZPC_PERIPH_PROTECTION_READ_WRITE_NONSECURE
  * @retval None
  */
__STATIC_INLINE void LL_ETZPC_Set_ETH1_PeriphProtection(ETZPC_TypeDef *ETZPCx, uint32_t protection)
{
  ETZPC_MODIFY_REG(DECPROT3, ETH1, protection);
}

/**
  * @brief  Set ETH2 peripheral (ETZPC Securable peripheral) protection.
  *
  * @param  ETZPCx ETZPC Instance
  * @param  protection  : protection level of the peripheral : possible values are
  *                      - LL_ETZPC_PERIPH_PROTECTION_READ_WRITE_SECURE
  *                      - LL_ETZPC_PERIPH_PROTECTION_READ_NONSECURE_WRITE_SECURE
  *                      - LL_ETZPC_PERIPH_PROTECTION_READ_WRITE_NONSECURE
  * @retval None
  */
__STATIC_INLINE void LL_ETZPC_Set_ETH2_PeriphProtection(ETZPC_TypeDef *ETZPCx, uint32_t protection)
{
  ETZPC_MODIFY_REG(DECPROT3, ETH2, protection);
}

/**
  * @brief  Set SDMMC1 peripheral (ETZPC Securable peripheral) protection.
  *
  * @param  ETZPCx ETZPC Instance
  * @param  protection  : protection level of the peripheral : possible values are
  *                      - LL_ETZPC_PERIPH_PROTECTION_READ_WRITE_SECURE
  *                      - LL_ETZPC_PERIPH_PROTECTION_READ_NONSECURE_WRITE_SECURE
  *                      - LL_ETZPC_PERIPH_PROTECTION_READ_WRITE_NONSECURE
  * @retval None
  */
__STATIC_INLINE void LL_ETZPC_Set_SDMMC1_PeriphProtection(ETZPC_TypeDef *ETZPCx, uint32_t protection)
{
  ETZPC_MODIFY_REG(DECPROT3, SDMMC1, protection);
}

/**
  * @brief  Set SDMMC2 peripheral (ETZPC Securable peripheral) protection.
  *
  * @param  ETZPCx ETZPC Instance
  * @param  protection  : protection level of the peripheral : possible values are
  *                      - LL_ETZPC_PERIPH_PROTECTION_READ_WRITE_SECURE
  *                      - LL_ETZPC_PERIPH_PROTECTION_READ_NONSECURE_WRITE_SECURE
  *                      - LL_ETZPC_PERIPH_PROTECTION_READ_WRITE_NONSECURE
  * @retval None
  */
__STATIC_INLINE void LL_ETZPC_Set_SDMMC2_PeriphProtection(ETZPC_TypeDef *ETZPCx, uint32_t protection)
{
  ETZPC_MODIFY_REG(DECPROT3, SDMMC2, protection);
}

/**
  * @brief  Set DDRMCE peripheral (ETZPC Securable peripheral) protection.
  *
  * @param  ETZPCx ETZPC Instance
  * @param  protection  : protection level of the peripheral : possible values are
  *                      - LL_ETZPC_PERIPH_PROTECTION_READ_WRITE_SECURE
  *                      - LL_ETZPC_PERIPH_PROTECTION_READ_NONSECURE_WRITE_SECURE
  *                      - LL_ETZPC_PERIPH_PROTECTION_READ_WRITE_NONSECURE
  * @retval None
  */
__STATIC_INLINE void LL_ETZPC_Set_DDRMCE_PeriphProtection(ETZPC_TypeDef *ETZPCx, uint32_t protection)
{
  ETZPC_MODIFY_REG(DECPROT3, DDRMCE, protection);
}

/**
  * @brief  Set FMC peripheral (ETZPC Securable peripheral) protection.
  *
  * @param  ETZPCx ETZPC Instance
  * @param  protection  : protection level of the peripheral : possible values are
  *                      - LL_ETZPC_PERIPH_PROTECTION_READ_WRITE_SECURE
  *                      - LL_ETZPC_PERIPH_PROTECTION_READ_NONSECURE_WRITE_SECURE
  *                      - LL_ETZPC_PERIPH_PROTECTION_READ_WRITE_NONSECURE
  * @retval None
  */
__STATIC_INLINE void LL_ETZPC_Set_FMC_PeriphProtection(ETZPC_TypeDef *ETZPCx, uint32_t protection)
{
  ETZPC_MODIFY_REG(DECPROT3, FMC, protection);
}

/**
  * @brief  Set QSPI peripheral (ETZPC Securable peripheral) protection.
  *
  * @param  ETZPCx ETZPC Instance
  * @param  protection  : protection level of the peripheral : possible values are
  *                      - LL_ETZPC_PERIPH_PROTECTION_READ_WRITE_SECURE
  *                      - LL_ETZPC_PERIPH_PROTECTION_READ_NONSECURE_WRITE_SECURE
  *                      - LL_ETZPC_PERIPH_PROTECTION_READ_WRITE_NONSECURE
  * @retval None
  */
__STATIC_INLINE void LL_ETZPC_Set_QSPI_PeriphProtection(ETZPC_TypeDef *ETZPCx, uint32_t protection)
{
  ETZPC_MODIFY_REG(DECPROT3, QSPI, protection);
}

/**
  * @brief  Set SRAM1 peripheral (ETZPC Securable peripheral) protection.
  *
  * @param  ETZPCx ETZPC Instance
  * @param  protection  : protection level of the peripheral : possible values are
  *                      - LL_ETZPC_PERIPH_PROTECTION_READ_WRITE_SECURE
  *                      - LL_ETZPC_PERIPH_PROTECTION_READ_NONSECURE_WRITE_SECURE
  *                      - LL_ETZPC_PERIPH_PROTECTION_READ_WRITE_NONSECURE
  * @retval None
  */
__STATIC_INLINE void LL_ETZPC_Set_SRAM1_PeriphProtection(ETZPC_TypeDef *ETZPCx, uint32_t protection)
{
  ETZPC_MODIFY_REG(DECPROT3, SRAM1, protection);
}

/**
  * @brief  Set SRAM2 peripheral (ETZPC Securable peripheral) protection.
  *
  * @param  ETZPCx ETZPC Instance
  * @param  protection  : protection level of the peripheral : possible values are
  *                      - LL_ETZPC_PERIPH_PROTECTION_READ_WRITE_SECURE
  *                      - LL_ETZPC_PERIPH_PROTECTION_READ_NONSECURE_WRITE_SECURE
  *                      - LL_ETZPC_PERIPH_PROTECTION_READ_WRITE_NONSECURE
  * @retval None
  */
__STATIC_INLINE void LL_ETZPC_Set_SRAM2_PeriphProtection(ETZPC_TypeDef *ETZPCx, uint32_t protection)
{
  ETZPC_MODIFY_REG(DECPROT3, SRAM2, protection);
}

/**
  * @brief  Set SRAM3 peripheral (ETZPC Securable peripheral) protection.
  *
  * @param  ETZPCx ETZPC Instance
  * @param  protection  : protection level of the peripheral : possible values are
  *                      - LL_ETZPC_PERIPH_PROTECTION_READ_WRITE_SECURE
  *                      - LL_ETZPC_PERIPH_PROTECTION_READ_NONSECURE_WRITE_SECURE
  *                      - LL_ETZPC_PERIPH_PROTECTION_READ_WRITE_NONSECURE
  * @retval None
  */
__STATIC_INLINE void LL_ETZPC_Set_SRAM3_PeriphProtection(ETZPC_TypeDef *ETZPCx, uint32_t protection)
{
  ETZPC_MODIFY_REG(DECPROT3, SRAM3, protection);
}

/**
  * @brief  Lock all peripherals (ETZPC Securable peripheral) protection.
  *
  * @param  ETZPCx ETZPC Instance
  * @retval None
  */
__STATIC_INLINE void LL_ETZPC_Lock_All_PeriphProtection(ETZPC_TypeDef *ETZPCx)
{
  ETZPCx->DECPROT_LOCK0 = 0xFFFFFFFFu;
  ETZPCx->DECPROT_LOCK1 = 0xFFFFFFFFu;
}

/**
  * @brief  Lock VREFBUF peripheral (ETZPC Securable peripheral) protection.
  *
  * @param  ETZPCx ETZPC Instance
  * @retval None
  */
__STATIC_INLINE void LL_ETZPC_Lock_VREFBUF_PeriphProtection(ETZPC_TypeDef *ETZPCx)
{
  ETZPC_SET_BIT(DECPROT_LOCK0, VREFBUF);
}

/**
  * @brief  Lock LPTIM2 peripheral (ETZPC Securable peripheral) protection.
  *
  * @param  ETZPCx ETZPC Instance
  * @retval None
  */
__STATIC_INLINE void LL_ETZPC_Lock_LPTIM2_PeriphProtection(ETZPC_TypeDef *ETZPCx)
{
  ETZPC_SET_BIT(DECPROT_LOCK0, LPTIM2);
}

/**
  * @brief  Lock LPTIM3 peripheral (ETZPC Securable peripheral) protection.
  *
  * @param  ETZPCx ETZPC Instance
  * @retval None
  */
__STATIC_INLINE void LL_ETZPC_Lock_LPTIM3_PeriphProtection(ETZPC_TypeDef *ETZPCx)
{
  ETZPC_SET_BIT(DECPROT_LOCK0, LPTIM3);
}

/**
  * @brief  Lock LTDC layer 2 peripheral (ETZPC Securable peripheral) protection.
  *
  * @param  ETZPCx ETZPC Instance
  * @retval None
  */
__STATIC_INLINE void LL_ETZPC_Lock_LTDC_PeriphProtection(ETZPC_TypeDef *ETZPCx)
{
  ETZPC_SET_BIT(DECPROT_LOCK0, LTDC);
}

/**
  * @brief  Lock DCMIPP peripheral (ETZPC Securable peripheral) protection.
  *
  * @param  ETZPCx ETZPC Instance
  * @retval None
  */
__STATIC_INLINE void LL_ETZPC_Lock_DCMIPP_PeriphProtection(ETZPC_TypeDef *ETZPCx)
{
  ETZPC_SET_BIT(DECPROT_LOCK0, DCMIPP);
}

/**
  * @brief  Lock USBPHYC peripheral (ETZPC Securable peripheral) protection.
  *
  * @param  ETZPCx ETZPC Instance
  * @retval None
  */
__STATIC_INLINE void LL_ETZPC_Lock_USBPHYC_PeriphProtection(ETZPC_TypeDef *ETZPCx)
{
  ETZPC_SET_BIT(DECPROT_LOCK0, USBPHYC);
}

/**
  * @brief  Lock DDRCTRL and DDRPHYC peripheral (ETZPC Securable peripheral) protection.
  *
  * @param  ETZPCx ETZPC Instance
  * @retval None
  */
__STATIC_INLINE void LL_ETZPC_Lock_DDRCTRL_PeriphProtection(ETZPC_TypeDef *ETZPCx)
{
  ETZPC_SET_BIT(DECPROT_LOCK0, DDRCTRL);
}

/**
  * @brief  Lock Independent Watchdog 1 (IWDG1) peripheral (ETZPC Securable peripheral) protection.
  *
  * @param  ETZPCx ETZPC Instance
  * @retval None
  */
__STATIC_INLINE void LL_ETZPC_Lock_IWDG1_PeriphProtection(ETZPC_TypeDef *ETZPCx)
{
  ETZPC_SET_BIT(DECPROT_LOCK0, IWDG1);
}

/**
  * @brief  Lock System Timer Generator (STGENC) peripheral (ETZPC Securable peripheral) protection.
  *
  * @param  ETZPCx ETZPC Instance
  * @retval None
  */
__STATIC_INLINE void LL_ETZPC_Lock_STGENC_PeriphProtection(ETZPC_TypeDef *ETZPCx)
{
  ETZPC_SET_BIT(DECPROT_LOCK0, STGENC);
}

/**
  * @brief  Lock secure USART1 peripheral (ETZPC Securable peripheral) protection.
  *
  * @param  ETZPCx ETZPC Instance
  * @retval None
  */
__STATIC_INLINE void LL_ETZPC_Lock_USART1_PeriphProtection(ETZPC_TypeDef *ETZPCx)
{
  ETZPC_SET_BIT(DECPROT_LOCK0, USART1);
}

/**
  * @brief  Lock secure USART2 peripheral (ETZPC Securable peripheral) protection.
  *
  * @param  ETZPCx ETZPC Instance
  * @retval None
  */
__STATIC_INLINE void LL_ETZPC_Lock_USART2_PeriphProtection(ETZPC_TypeDef *ETZPCx)
{
  ETZPC_SET_BIT(DECPROT_LOCK0, USART2);
}

/**
  * @brief  Lock SPI4 peripheral (ETZPC Securable peripheral) protection.
  *
  * @param  ETZPCx ETZPC Instance
  * @retval None
  */
__STATIC_INLINE void LL_ETZPC_Lock_SPI4_PeriphProtection(ETZPC_TypeDef *ETZPCx)
{
  ETZPC_SET_BIT(DECPROT_LOCK0, SPI4);
}

/**
  * @brief  Lock SPI5 peripheral (ETZPC Securable peripheral) protection.
  *
  * @param  ETZPCx ETZPC Instance
  * @retval None
  */
__STATIC_INLINE void LL_ETZPC_Lock_SPI5_PeriphProtection(ETZPC_TypeDef *ETZPCx)
{
  ETZPC_SET_BIT(DECPROT_LOCK0, SPI5);
}

/**
  * @brief  Lock I2C3 peripheral (ETZPC Securable peripheral) protection.
  *
  * @param  ETZPCx ETZPC Instance
  * @retval None
  */
__STATIC_INLINE void LL_ETZPC_Lock_I2C3_PeriphProtection(ETZPC_TypeDef *ETZPCx)
{
  ETZPC_SET_BIT(DECPROT_LOCK0, I2C3);
}

/**
  * @brief  Lock I2C4 peripheral (ETZPC Securable peripheral) protection.
  *
  * @param  ETZPCx ETZPC Instance
  * @retval None
  */
__STATIC_INLINE void LL_ETZPC_Lock_I2C4_PeriphProtection(ETZPC_TypeDef *ETZPCx)
{
  ETZPC_SET_BIT(DECPROT_LOCK0, I2C4);
}

/**
  * @brief  Lock I2C5 peripheral (ETZPC Securable peripheral) protection.
  *
  * @param  ETZPCx ETZPC Instance
  * @retval None
  */
__STATIC_INLINE void LL_ETZPC_Lock_I2C5_PeriphProtection(ETZPC_TypeDef *ETZPCx)
{
  ETZPC_SET_BIT(DECPROT_LOCK0, I2C5);
}

/**
  * @brief  Lock TIM12 peripheral (ETZPC Securable peripheral) protection.
  *
  * @param  ETZPCx ETZPC Instance
  * @retval None
  */
__STATIC_INLINE void LL_ETZPC_Lock_TIM12_PeriphProtection(ETZPC_TypeDef *ETZPCx)
{
  ETZPC_SET_BIT(DECPROT_LOCK0, TIM12);
}

/**
  * @brief  Lock TIM13 peripheral (ETZPC Securable peripheral) protection.
  *
  * @param  ETZPCx ETZPC Instance
  * @retval None
  */
__STATIC_INLINE void LL_ETZPC_Lock_TIM13_PeriphProtection(ETZPC_TypeDef *ETZPCx)
{
  ETZPC_SET_BIT(DECPROT_LOCK0, TIM13);
}

/**
  * @brief  Lock TIM14 peripheral (ETZPC Securable peripheral) protection.
  *
  * @param  ETZPCx ETZPC Instance
  * @retval None
  */
__STATIC_INLINE void LL_ETZPC_Lock_TIM14_PeriphProtection(ETZPC_TypeDef *ETZPCx)
{
  ETZPC_SET_BIT(DECPROT_LOCK0, TIM14);
}

/**
  * @brief  Lock TIM15 peripheral (ETZPC Securable peripheral) protection.
  *
  * @param  ETZPCx ETZPC Instance
  * @retval None
  */
__STATIC_INLINE void LL_ETZPC_Lock_TIM15_PeriphProtection(ETZPC_TypeDef *ETZPCx)
{
  ETZPC_SET_BIT(DECPROT_LOCK0, TIM15);
}

/**
  * @brief  Lock TIM16 peripheral (ETZPC Securable peripheral) protection.
  *
  * @param  ETZPCx ETZPC Instance
  * @retval None
  */
__STATIC_INLINE void LL_ETZPC_Lock_TIM16_PeriphProtection(ETZPC_TypeDef *ETZPCx)
{
  ETZPC_SET_BIT(DECPROT_LOCK0, TIM16);
}

/**
  * @brief  Lock TIM17 peripheral (ETZPC Securable peripheral) protection.
  *
  * @param  ETZPCx ETZPC Instance
  * @retval None
  */
__STATIC_INLINE void LL_ETZPC_Lock_TIM17_PeriphProtection(ETZPC_TypeDef *ETZPCx)
{
  ETZPC_SET_BIT(DECPROT_LOCK0, TIM17);
}

/**
  * @brief  Lock ADC1 peripheral (ETZPC Securable peripheral) protection.
  *
  * @param  ETZPCx ETZPC Instance
  * @retval None
  */
__STATIC_INLINE void LL_ETZPC_Lock_ADC1_PeriphProtection(ETZPC_TypeDef *ETZPCx)
{
  ETZPC_SET_BIT(DECPROT_LOCK1, ADC1);
}

/**
  * @brief  Lock ADC2 peripheral (ETZPC Securable peripheral) protection.
  *
  * @param  ETZPCx ETZPC Instance
  * @retval None
  */
__STATIC_INLINE void LL_ETZPC_Lock_ADC2_PeriphProtection(ETZPC_TypeDef *ETZPCx)
{
  ETZPC_SET_BIT(DECPROT_LOCK1, ADC2);
}

/**
  * @brief  Lock OTG peripheral (ETZPC Securable peripheral) protection.
  *
  * @param  ETZPCx ETZPC Instance
  * @retval None
  */
__STATIC_INLINE void LL_ETZPC_Lock_OTG_PeriphProtection(ETZPC_TypeDef *ETZPCx)
{
  ETZPC_SET_BIT(DECPROT_LOCK1, OTG);
}

/**
  * @brief  Lock RNG peripheral (ETZPC Securable peripheral) protection.
  *
  * @param  ETZPCx ETZPC Instance
  * @retval None
  */
__STATIC_INLINE void LL_ETZPC_Lock_RNG_PeriphProtection(ETZPC_TypeDef *ETZPCx)
{
  ETZPC_SET_BIT(DECPROT_LOCK1, RNG);
}

/**
  * @brief  Lock HASH peripheral (ETZPC Securable peripheral) protection.
  *
  * @param  ETZPCx ETZPC Instance
  * @retval None
  */
__STATIC_INLINE void LL_ETZPC_Lock_HASH_PeriphProtection(ETZPC_TypeDef *ETZPCx)
{
  ETZPC_SET_BIT(DECPROT_LOCK1, HASH);
}

/**
  * @brief  Lock CRYP peripheral (ETZPC Securable peripheral) protection.
  *
  * @param  ETZPCx ETZPC Instance
  * @retval None
  */
__STATIC_INLINE void LL_ETZPC_Lock_CRYP_PeriphProtection(ETZPC_TypeDef *ETZPCx)
{
  ETZPC_SET_BIT(DECPROT_LOCK1, CRYP);
}

/**
  * @brief  Lock SAES peripheral (ETZPC Securable peripheral) protection.
  *
  * @param  ETZPCx ETZPC Instance
  * @retval None
  */
__STATIC_INLINE void LL_ETZPC_Lock_SAES_PeriphProtection(ETZPC_TypeDef *ETZPCx)
{
  ETZPC_SET_BIT(DECPROT_LOCK1, SAES);
}

/**
  * @brief  Lock PKA peripheral (ETZPC Securable peripheral) protection.
  *
  * @param  ETZPCx ETZPC Instance
  * @retval None
  */
__STATIC_INLINE void LL_ETZPC_Lock_PKA_PeriphProtection(ETZPC_TypeDef *ETZPCx)
{
  ETZPC_SET_BIT(DECPROT_LOCK1, PKA);
}

/**
  * @brief  Lock Backup RAM (BKPSRAM) peripheral (ETZPC Securable peripheral) protection.
  *
  * @param  ETZPCx ETZPC Instance
  * @retval None
  */
__STATIC_INLINE void LL_ETZPC_Lock_BKPSRAM_PeriphProtection(ETZPC_TypeDef *ETZPCx)
{
  ETZPC_SET_BIT(DECPROT_LOCK1, BKPSRAM);
}

/**
  * @brief  Lock ETH1 peripheral (ETZPC Securable peripheral) protection.
  *
  * @param  ETZPCx ETZPC Instance
  * @retval None
  */
__STATIC_INLINE void LL_ETZPC_Lock_ETH1_PeriphProtection(ETZPC_TypeDef *ETZPCx)
{
  ETZPC_SET_BIT(DECPROT_LOCK1, ETH1);
}

/**
  * @brief  Lock ETH2 peripheral (ETZPC Securable peripheral) protection.
  *
  * @param  ETZPCx ETZPC Instance
  * @retval None
  */
__STATIC_INLINE void LL_ETZPC_Lock_ETH2_PeriphProtection(ETZPC_TypeDef *ETZPCx)
{
  ETZPC_SET_BIT(DECPROT_LOCK1, ETH2);
}

/**
  * @brief  Lock SDMMC1 peripheral (ETZPC Securable peripheral) protection.
  *
  * @param  ETZPCx ETZPC Instance
  * @retval None
  */
__STATIC_INLINE void LL_ETZPC_Lock_SDMMC1_PeriphProtection(ETZPC_TypeDef *ETZPCx)
{
  ETZPC_SET_BIT(DECPROT_LOCK1, SDMMC1);
}

/**
  * @brief  Lock SDMMC2 peripheral (ETZPC Securable peripheral) protection.
  *
  * @param  ETZPCx ETZPC Instance
  * @retval None
  */
__STATIC_INLINE void LL_ETZPC_Lock_SDMMC2_PeriphProtection(ETZPC_TypeDef *ETZPCx)
{
  ETZPC_SET_BIT(DECPROT_LOCK1, SDMMC2);
}

/**
  * @brief  Lock DDRMCE peripheral (ETZPC Securable peripheral) protection.
  *
  * @param  ETZPCx ETZPC Instance
  * @retval None
  */
__STATIC_INLINE void LL_ETZPC_Lock_DDRMCE_PeriphProtection(ETZPC_TypeDef *ETZPCx)
{
  ETZPC_SET_BIT(DECPROT_LOCK1, DDRMCE);
}

/**
  * @brief  Lock FMC peripheral (ETZPC Securable peripheral) protection.
  *
  * @param  ETZPCx ETZPC Instance
  * @retval None
  */
__STATIC_INLINE void LL_ETZPC_Lock_FMC_PeriphProtection(ETZPC_TypeDef *ETZPCx)
{
  ETZPC_SET_BIT(DECPROT_LOCK1, FMC);
}

/**
  * @brief  Lock QSPI peripheral (ETZPC Securable peripheral) protection.
  *
  * @param  ETZPCx ETZPC Instance
  * @retval None
  */
__STATIC_INLINE void LL_ETZPC_Lock_QSPI_PeriphProtection(ETZPC_TypeDef *ETZPCx)
{
  ETZPC_SET_BIT(DECPROT_LOCK1, QSPI);
}

/**
  * @brief  Lock SRAM1 peripheral (ETZPC Securable peripheral) protection.
  *
  * @param  ETZPCx ETZPC Instance
  * @retval None
  */
__STATIC_INLINE void LL_ETZPC_Lock_SRAM1_PeriphProtection(ETZPC_TypeDef *ETZPCx)
{
  ETZPC_SET_BIT(DECPROT_LOCK1, SRAM1);
}

/**
  * @brief  Lock SRAM2 peripheral (ETZPC Securable peripheral) protection.
  *
  * @param  ETZPCx ETZPC Instance
  * @retval None
  */
__STATIC_INLINE void LL_ETZPC_Lock_SRAM2_PeriphProtection(ETZPC_TypeDef *ETZPCx)
{
  ETZPC_SET_BIT(DECPROT_LOCK1, SRAM2);
}

/**
  * @brief  Lock SRAM3 peripheral (ETZPC Securable peripheral) protection.
  *
  * @param  ETZPCx ETZPC Instance
  * @retval None
  */
__STATIC_INLINE void LL_ETZPC_Lock_SRAM3_PeriphProtection(ETZPC_TypeDef *ETZPCx)
{
  ETZPC_SET_BIT(DECPROT_LOCK1, SRAM3);
}

/**
  * @}
  */

/**
  * @}
  */

/* ---------------------------------------------------------------------------*/

/**
  * @}
  */

/**
  * @}
  */

#ifdef __cplusplus
}
#endif

#endif /* STM32MP13xx_LL_ETZPC_H */
